antigo/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.5962;

boundaryField
{
    inlet
    {
        type        fixedValue;
        //value       uniform 30.375;
        // Or: OpenFOAM provides an inlet condition for k
       // type            turbulentIntensityKineticEnergyInlet;
       // intensity       0.05;
        value           uniform 1.5962;
    }
    outlet
    {
        type            zeroGradient;
    }
    OrificeFlow
    {
        type            fixedValue;
	value		uniform 0;
    }
 //   airfoil
 //   {
 //       type            kqRWallFunction;
 //       value           $internalField;
 //   }
 //   frontAndBack
  //  {
  //      type            empty;
  //  }
}


// ************************************************************************* //
