antigo/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    OrificeFlowmeter.stl
      {
        type triSurfaceMesh;
        name OrificeFlow;
      }
    inlet.stl
      {
        type triSurfaceMesh;
        name inlet;
      }
    outlet.stl
      {
        type triSurfaceMesh;
        name outlet;
      }
    
     OrificeSphere
   
      {
        type    searchableSphere;
        centre             (25.4 25.4 128.588);
        radius             44;
      }


 //   sphereInRightEar
 //   {
  //      type    searchableSphere;
  //      centre  (8.0 162.0 112.8);
  //      radius  30.0;
  //  }
   // sphereInNose
   // {
   //     type    searchableSphere;
   //     centre  (81.6 166.1 212.0);
   //     radius  30.0;
   // }
    //box
    //{
    //    type    searchableBox;
    //    min     (-0.2 -0.2 -0.02);
    //    max     (0.44 0.2 0.32);
    //}
    //cylinder
    //{
    //    type    searchableCylinder;
    //    point1  (0 0 0);
    //    point2  (1 0 0);
    //    radius  0.1;
    //}
    //plane
    //{
    //    type        searchablePlane;
    //    planeType   pointAndNormal;
    //    pointAndNormalDict
    //    {
    //        basePoint   (0 0 0);
    //        normalVector (0 1 0);
    //    }
    //}
    //plate
    //{
    //    type searchablePlate;
    //    origin (0 0 0);
    //    span (0.5 0.5 0);
    //}
}


// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    maxLocalCells       100000;
    maxGlobalCells      2000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 5;

    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    features
    (
        {
            file "OrificeFlowmeter.eMesh";
            level 7;
        }
    );

    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~
    refinementSurfaces
    {
        OrificeFlow
        {
            level (3 6);

            patchInfo
            {
                // Either 'wall', 'patch', 'symmetry'
                type wall;
                //inGroups (walls);
            }
        }
         inlet
         {
              level (3 6);

              patchInfo
             {
                // Either 'wall', 'patch', 'symmetry'
                 type patch;
                //inGroups (walls);
             }
         }
	 outlet
	{
              level (3 6);

              patchInfo
             {
                // Either 'wall', 'patch', 'symmetry'
                 type patch;
                //inGroups (walls);
             }
         }
    }

    // Resolve sharp angles
    resolveFeatureAngle 20;

    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~
    refinementRegions
    {
       OrificeSphere
        {
            mode    inside;
            levels  ((0.5 5));
        }
     
	 OrificeFlow
	 {
		 mode distance;
		 levels ((3 5));
	 }
	 inlet
	{
		mode distance;
		levels ((3 5));
	}
	 outlet
 	 {
		mode distance;
		levels ((3 5));
	}

   //     sphereInRightEar
    //     {
    //        mode    inside;
    //        levels  ((1e15 4));
    //    }
    //    sphereInNose
    //    {
    //        mode    inside;
    //        levels  ((1e15 5));
     //   }
    }

    // Mesh selection
    // ~~~~~~~~~~~~~~

    // Point outside the cylinder and inside the box
   // locationInMesh              (0.0 0.0 0.0); // Point outside the head
    locationInMesh              (25.4 25.4 107.555);
    allowFreeStandingZoneFaces  true;
}

// Settings for the snapping.
snapControls
{
    nSmoothPatch    4;
    tolerance       2.0;
    nSolveIter      50;
    nRelaxIter      6;

    // Feature snapping
    nFeatureSnapIter        10;
    implicitFeatureSnap     false;
    explicitFeatureSnap     true;
    multiRegionFeatureSnap  false;
}

// Settings for the layer addition.
addLayersControls
{
    relativeSizes true;

    layers
    {
        OrificeFlow
        {
            nSurfaceLayers 6;
        }

        inlet
         {
       	    nSurfaceLayers 6;
         }

	outlet
       	{
     		nSurfaceLayers 6;
         }
	
    }

    expansionRatio      1.15;
    finalLayerThickness 0.3;
    //firstLayerThickness 0.2;
    //thickness           1.0;

    minThickness        0.1;
    nGrow               0;

    // Advanced settings

    featureAngle        180;
    slipFeatureAngle    30;
    nRelaxIter          3;

    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;

    maxFaceThicknessRatio       0.5;
    maxThicknessToMedialRatio   0.3;
    minMedialAxisAngle          90;
    nBufferCellsNoExtrude       0;
    nLayerIter                  50;
}

// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    #include "meshQualityDict"

    // Advanced
    nSmoothScale 4;
    errorReduction 0.75;
}


// Advanced

// Write flags
writeFlags
(
    scalarLevels
    layerSets
    layerFields     // write volScalarField for layer coverage
);


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;

debug 0;

// ************************************************************************* //
